zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_dma_ex.h
  DMA_RepeatBlockConfTypeDef  RepeatBlockConfig;  /*!< Specifies the DMA channel repeated block configuration         */

  uint32_t                    SrcAddress;         /*!< Specifies the source memory address                            */
  uint32_t                    DstAddress;         /*!< Specifies the destination memory address                       */
  uint32_t                    DataSize;           /*!< Specifies the source data size in bytes                        */

#if defined CORTEX_IN_SECURE_STATE
  uint32_t                    SrcSecure;          /*!< Specifies the source security attribute                        */
  uint32_t                    DestSecure;         /*!< Specifies the destination security attribute                   */
#endif /* CORTEX_IN_SECURE_STATE */

} DMA_NodeConfTypeDef;

/**
  * @brief  DMAEx Linked-List Node Structure Definition.
  */
typedef struct
{
  uint32_t LinkRegisters[8U]; /*!< Physical Node register description */
  uint32_t NodeInfo;          /*!< Node information                   */

} DMA_NodeTypeDef;

/**
  * @brief DMAEx Linked-List Queue Structure Definition.
  */
typedef struct __DMA_QListTypeDef
{
  DMA_NodeTypeDef                *Head;              /*!< Specifies the queue head node                    */

  DMA_NodeTypeDef                *FirstCircularNode; /*!< Specifies the queue first circular node          */

  uint32_t                       NodeNumber;         /*!< Specifies the queue node number                  */

  __IO HAL_DMA_QStateTypeDef     State;              /*!< Specifies the queue state                        */

  __IO uint32_t                  ErrorCode;          /*!< Specifies the queue error code                   */

  __IO uint32_t                  Type;               /*!< Specifies whether the queue is static or dynamic */

} DMA_QListTypeDef;
/**
  * @}
  */

/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup DMAEx_Exported_Constants DMAEx Exported Constants
  * @brief    DMAEx Exported Constants
  * @{
  */

/** @defgroup Queue_Error_Codes Queue Error Codes
  * @brief    Queue Error Codes
  * @{
  */
#define HAL_DMA_QUEUE_ERROR_NONE        (0x00U) /*!< No error                                                */
#define HAL_DMA_QUEUE_ERROR_BUSY        (0x01U) /*!< Error busy                                              */
#define HAL_DMA_QUEUE_ERROR_EMPTY       (0x02U) /*!< Error unallowed operation for empty queue               */
#define HAL_DMA_QUEUE_ERROR_UNSUPPORTED (0x03U) /*!< Error unsupported feature                               */
#define HAL_DMA_QUEUE_ERROR_INVALIDTYPE (0x04U) /*!< Error incompatible node type or circular initialization
                                                     and queue circular types are incompatible               */
#define HAL_DMA_QUEUE_ERROR_OUTOFRANGE  (0x05U) /*!< Error out of range node memory                          */
#define HAL_DMA_QUEUE_ERROR_NOTFOUND    (0x06U) /*!< Error node not found in queue                           */
/**
  * @}
  */

/** @defgroup DMAEx_LinkedList_Mode DMAEx LinkedList Mode
  * @brief    DMAEx LinkedList Mode
  * @{
  */
#define DMA_LINKEDLIST_NORMAL   DMA_LINKEDLIST             /*!< Linear linked-list DMA channel transfer   */
#define DMA_LINKEDLIST_CIRCULAR (DMA_LINKEDLIST | (0x01U)) /*!< Circular linked-list DMA channel transfer */
/**
  * @}
  */

/** @defgroup DMAEx_Data_Alignment DMAEx Data Alignment
  * @brief    DMAEx Data Alignment
  * @{
  */
#define DMA_DATA_RIGHTALIGN_ZEROPADDED 0x00000000U    /*!< If source data width < destination data width
                                                           => Right aligned padded with 0 up to destination data
                                                              width                                              */
#define DMA_DATA_RIGHTALIGN_LEFTTRUNC  0x00000000U    /*!< If source data width > destination data width
                                                           => Right aligned left Truncated down to destination
                                                              data width                                         */
#define DMA_DATA_RIGHTALIGN_SIGNEXT    DMA_CTR1_PAM_0 /*!< If source data width < destination data width
                                                           => Right Aligned padded with sign extended up to
                                                              destination data width                             */
#define DMA_DATA_LEFTALIGN_RIGHTTRUNC  DMA_CTR1_PAM_0 /*!< If source data width > destination data width
                                                           => Left Aligned Right Truncated down to the
                                                              destination data width                             */
#define DMA_DATA_PACK                  DMA_CTR1_PAM_1 /*!< If source data width < destination data width
                                                          < => Packed at the destination data width
                                                              (Not available on LPDMA)                           */

#define DMA_DATA_UNPACK                DMA_CTR1_PAM_1 /*!< If source data width > destination data width
                                                           => Unpacked at the destination data width
                                                              (Not available on LPDMA)                           */

/**
  * @}
  */

/** @defgroup DMAEx_Data_Exchange DMAEx Data Exchange
  * @brief    DMAEx Data Exchange
  * @{
  */
#define DMA_EXCHANGE_NONE          0x00000000U  /*!< No data exchange                                                          */
#define DMA_EXCHANGE_DEST_BYTE     DMA_CTR1_DBX /*!< Destination Byte exchange when destination data width is > Byte           */
#define DMA_EXCHANGE_DEST_HALFWORD DMA_CTR1_DHX /*!< Destination Half-Word exchange when destination data width is > Half-Word */
#define DMA_EXCHANGE_SRC_BYTE      DMA_CTR1_SBX /*!< Source Byte endianness exchange when source data width is word            */
#define DMA_EXCHANGE_DEST_WORD     DMA_CTR1_DWX /*!< Destination Word exchange when destination data width is > Word */
/**
  * @}
  */

/** @defgroup DMAEx_Trigger_Polarity DMAEx Trigger Polarity
  * @brief    DMAEx Trigger Polarity
  * @{
  */
#define DMA_TRIG_POLARITY_MASKED  0x00000000U        /*!< No trigger of the selected DMA request. Masked trigger event                                */
#define DMA_TRIG_POLARITY_RISING  DMA_CTR2_TRIGPOL_0 /*!< Trigger of the selected DMA request on the rising edge of the selected trigger event input  */
#define DMA_TRIG_POLARITY_FALLING DMA_CTR2_TRIGPOL_1 /*!< Trigger of the selected DMA request on the falling edge of the selected trigger event input */
/**
  * @}
  */

/** @defgroup DMAEx_Trigger_Mode DMAEx Trigger Mode
  * @brief    DMAEx Trigger Mode
  * @{
  */
#define DMA_TRIGM_BLOCK_TRANSFER          0x00000000U      /*!< A block transfer is conditioned by (at least) one hit trigger          */
#define DMA_TRIGM_REPEATED_BLOCK_TRANSFER DMA_CTR2_TRIGM_0 /*!< A repeated block transfer is conditioned by (at least) one hit trigger */
#define DMA_TRIGM_LLI_LINK_TRANSFER       DMA_CTR2_TRIGM_1 /*!< A LLI link transfer is conditioned by (at least) one hit trigger       */
#define DMA_TRIGM_SINGLE_BURST_TRANSFER   DMA_CTR2_TRIGM   /*!< A single/burst transfer is conditioned by (at least) one hit trigger   */
/**
  * @}
  */

/** @defgroup DMAEx_Trigger_Selection DMAEx Trigger Selection
  * @brief    DMAEx Trigger Selection
  * @{
  */
/* HPDMA triggers */
#if defined(LPDMA)

#define HPDMA_TRIGGER_EXTI_LINE0      (0U)  /*!< HPDMA HW Trigger signal is EXTI_LINE0      */
#define HPDMA_TRIGGER_EXTI_LINE1      (1U)  /*!< HPDMA HW Trigger signal is EXTI_LINE1      */
#define HPDMA_TRIGGER_EXTI_LINE2      (2U)  /*!< HPDMA HW Trigger signal is EXTI_LINE2      */
#define HPDMA_TRIGGER_EXTI_LINE3      (3U)  /*!< HPDMA HW Trigger signal is EXTI_LINE3      */
#define HPDMA_TRIGGER_EXTI_LINE4      (4U)  /*!< HPDMA HW Trigger signal is EXTI_LINE4      */
#define HPDMA_TRIGGER_EXTI_LINE5      (5U)  /*!< HPDMA HW Trigger signal is EXTI_LINE5      */
#define HPDMA_TRIGGER_EXTI_LINE6      (6U)  /*!< HPDMA HW Trigger signal is EXTI_LINE6      */
#define HPDMA_TRIGGER_EXTI_LINE7      (7U)  /*!< HPDMA HW Trigger signal is EXTI_LINE7      */
#define HPDMA_TRIGGER_EXTI_LINE8      (8U)  /*!< HPDMA HW Trigger signal is EXTI_LINE8      */
#define HPDMA_TRIGGER_EXTI_LINE9      (9U)  /*!< HPDMA HW Trigger signal is EXTI_LINE9      */
#define HPDMA_TRIGGER_EXTI_LINE10     (10U) /*!< HPDMA HW Trigger signal is EXTI_LINE10     */
#define HPDMA_TRIGGER_EXTI_LINE11     (11U) /*!< HPDMA HW Trigger signal is EXTI_LINE11     */
#define HPDMA_TRIGGER_EXTI_LINE12     (12U) /*!< HPDMA HW Trigger signal is EXTI_LINE12     */
#define HPDMA_TRIGGER_EXTI_LINE13     (13U) /*!< HPDMA HW Trigger signal is EXTI_LINE13     */
#define HPDMA_TRIGGER_EXTI_LINE14     (14U) /*!< HPDMA HW Trigger signal is EXTI_LINE14     */
#define HPDMA_TRIGGER_EXTI_LINE15     (15U) /*!< HPDMA HW Trigger signal is EXTI_LINE15     */
#define HPDMA_TRIGGER_LPTIM1_CH1      (16U) /*!< HPDMA HW Trigger signal is LPTIM1_CH1      */
#define HPDMA_TRIGGER_LPTIM2_CH1      (17U) /*!< HPDMA HW Trigger signal is LPTIM2_CH1      */
#define HPDMA_TRIGGER_LPTIM3_CH1      (18U) /*!< HPDMA HW Trigger signal is LPTIM3_CH1      */
#define HPDMA_TRIGGER_LPTIM4_CH1      (19U) /*!< HPDMA HW Trigger signal is LPTIM4_CH1      */
#define HPDMA_TRIGGER_LPTIM5_CH1      (20U) /*!< HPDMA HW Trigger signal is LPTIM5_CH1      */
#define HPDMA_TRIGGER_RTC_ALRA_TRG    (21U) /*!< HPDMA HW Trigger signal is RTC_ALRA_TRG    */
#define HPDMA_TRIGGER_RTC_ALRB_TRG    (22U) /*!< HPDMA HW Trigger signal is RTC_ALRB_TRG    */
#define HPDMA_TRIGGER_RTC_WUT_TRG     (23U) /*!< HPDMA HW Trigger signal is RTC_WUT_TRG     */
#define HPDMA_TRIGGER_LPDMA_CH0_TCF   (24U) /*!< HPDMA HW Trigger signal is LPDMA_CH0_TCF   */
#define HPDMA_TRIGGER_LPDMA_CH1_TCF   (25U) /*!< HPDMA HW Trigger signal is LPDMA_CH1_TCF   */
#define HPDMA_TRIGGER_LPDMA_CH2_TCF   (26U) /*!< HPDMA HW Trigger signal is LPDMA_CH2_TCF   */
#define HPDMA_TRIGGER_LPDMA_CH3_TCF   (27U) /*!< HPDMA HW Trigger signal is LPDMA_CH3_TCF   */
#define HPDMA_TRIGGER_HPDMA1_CH0_TCF  (28U) /*!< HPDMA HW Trigger signal is HPDMA1_CH0_TCF  */
#define HPDMA_TRIGGER_HPDMA1_CH1_TCF  (29U) /*!< HPDMA HW Trigger signal is HPDMA1_CH1_TCF  */
#define HPDMA_TRIGGER_HPDMA1_CH2_TCF  (30U) /*!< HPDMA HW Trigger signal is HPDMA1_CH2_TCF  */
#define HPDMA_TRIGGER_HPDMA1_CH3_TCF  (31U) /*!< HPDMA HW Trigger signal is HPDMA1_CH3_TCF  */
#define HPDMA_TRIGGER_HPDMA1_CH4_TCF  (32U) /*!< HPDMA HW Trigger signal is HPDMA1_CH4_TCF  */
#define HPDMA_TRIGGER_HPDMA1_CH5_TCF  (33U) /*!< HPDMA HW Trigger signal is HPDMA1_CH5_TCF  */
#define HPDMA_TRIGGER_HPDMA1_CH6_TCF  (34U) /*!< HPDMA HW Trigger signal is HPDMA1_CH6_TCF  */
#define HPDMA_TRIGGER_HPDMA1_CH7_TCF  (35U) /*!< HPDMA HW Trigger signal is HPDMA1_CH7_TCF  */
#define HPDMA_TRIGGER_HPDMA1_CH8_TCF  (36U) /*!< HPDMA HW Trigger signal is HPDMA1_CH8_TCF  */
#define HPDMA_TRIGGER_HPDMA1_CH9_TCF  (37U) /*!< HPDMA HW Trigger signal is HPDMA1_CH9_TCF  */
#define HPDMA_TRIGGER_HPDMA1_CH10_TCF (38U) /*!< HPDMA HW Trigger signal is HPDMA1_CH10_TCF */
#define HPDMA_TRIGGER_HPDMA1_CH11_TCF (39U) /*!< HPDMA HW Trigger signal is HPDMA1_CH11_TCF */
#define HPDMA_TRIGGER_HPDMA1_CH12_TCF (40U) /*!< HPDMA HW Trigger signal is HPDMA1_CH12_TCF */
#define HPDMA_TRIGGER_HPDMA1_CH13_TCF (41U) /*!< HPDMA HW Trigger signal is HPDMA1_CH13_TCF */
#define HPDMA_TRIGGER_HPDMA1_CH14_TCF (42U) /*!< HPDMA HW Trigger signal is HPDMA1_CH14_TCF */
#define HPDMA_TRIGGER_HPDMA1_CH15_TCF (43U) /*!< HPDMA HW Trigger signal is HPDMA1_CH15_TCF */
#define HPDMA_TRIGGER_HPDMA2_CH0_TCF  (44U) /*!< HPDMA HW Trigger signal is HPDMA2_CH0_TCF  */
#define HPDMA_TRIGGER_HPDMA2_CH1_TCF  (45U) /*!< HPDMA HW Trigger signal is HPDMA2_CH1_TCF  */
#define HPDMA_TRIGGER_HPDMA2_CH2_TCF  (46U) /*!< HPDMA HW Trigger signal is HPDMA2_CH2_TCF  */
#define HPDMA_TRIGGER_HPDMA2_CH3_TCF  (47U) /*!< HPDMA HW Trigger signal is HPDMA2_CH3_TCF  */
#define HPDMA_TRIGGER_HPDMA2_CH4_TCF  (48U) /*!< HPDMA HW Trigger signal is HPDMA2_CH4_TCF  */
#define HPDMA_TRIGGER_HPDMA2_CH5_TCF  (49U) /*!< HPDMA HW Trigger signal is HPDMA2_CH5_TCF  */
#define HPDMA_TRIGGER_HPDMA2_CH6_TCF  (50U) /*!< HPDMA HW Trigger signal is HPDMA2_CH6_TCF  */
#define HPDMA_TRIGGER_HPDMA2_CH7_TCF  (51U) /*!< HPDMA HW Trigger signal is HPDMA2_CH7_TCF  */
#define HPDMA_TRIGGER_HPDMA2_CH8_TCF  (52U) /*!< HPDMA HW Trigger signal is HPDMA2_CH8_TCF  */
#define HPDMA_TRIGGER_HPDMA2_CH9_TCF  (53U) /*!< HPDMA HW Trigger signal is HPDMA2_CH9_TCF  */
#define HPDMA_TRIGGER_HPDMA2_CH10_TCF (54U) /*!< HPDMA HW Trigger signal is HPDMA2_CH10_TCF */
#define HPDMA_TRIGGER_HPDMA2_CH11_TCF (55U) /*!< HPDMA HW Trigger signal is HPDMA2_CH11_TCF */
#define HPDMA_TRIGGER_HPDMA2_CH12_TCF (56U) /*!< HPDMA HW Trigger signal is HPDMA2_CH12_TCF */
#define HPDMA_TRIGGER_HPDMA2_CH13_TCF (57U) /*!< HPDMA HW Trigger signal is HPDMA2_CH13_TCF */
#define HPDMA_TRIGGER_HPDMA2_CH14_TCF (58U) /*!< HPDMA HW Trigger signal is HPDMA2_CH14_TCF */
#define HPDMA_TRIGGER_HPDMA2_CH15_TCF (59U) /*!< HPDMA HW Trigger signal is HPDMA2_CH15_TCF */
#define HPDMA_TRIGGER_HPDMA3_CH0_TCF  (60U) /*!< HPDMA HW Trigger signal is HPDMA3_CH0_TCF  */
#define HPDMA_TRIGGER_HPDMA3_CH1_TCF  (61U) /*!< HPDMA HW Trigger signal is HPDMA3_CH1_TCF  */
#define HPDMA_TRIGGER_HPDMA3_CH2_TCF  (62U) /*!< HPDMA HW Trigger signal is HPDMA3_CH2_TCF  */
#define HPDMA_TRIGGER_HPDMA3_CH3_TCF  (63U) /*!< HPDMA HW Trigger signal is HPDMA3_CH3_TCF  */
#define HPDMA_TRIGGER_HPDMA3_CH4_TCF  (64U) /*!< HPDMA HW Trigger signal is HPDMA3_CH4_TCF  */
#define HPDMA_TRIGGER_HPDMA3_CH5_TCF  (65U) /*!< HPDMA HW Trigger signal is HPDMA3_CH5_TCF  */
#define HPDMA_TRIGGER_HPDMA3_CH6_TCF  (66U) /*!< HPDMA HW Trigger signal is HPDMA3_CH6_TCF  */
#define HPDMA_TRIGGER_HPDMA3_CH7_TCF  (67U) /*!< HPDMA HW Trigger signal is HPDMA3_CH7_TCF  */
#define HPDMA_TRIGGER_HPDMA3_CH8_TCF  (68U) /*!< HPDMA HW Trigger signal is HPDMA3_CH8_TCF  */
#define HPDMA_TRIGGER_HPDMA3_CH9_TCF  (69U) /*!< HPDMA HW Trigger signal is HPDMA3_CH9_TCF  */
#define HPDMA_TRIGGER_HPDMA3_CH10_TCF (70U) /*!< HPDMA HW Trigger signal is HPDMA3_CH10_TCF */
#define HPDMA_TRIGGER_HPDMA3_CH11_TCF (71U) /*!< HPDMA HW Trigger signal is HPDMA3_CH11_TCF */
#define HPDMA_TRIGGER_HPDMA3_CH12_TCF (72U) /*!< HPDMA HW Trigger signal is HPDMA3_CH12_TCF */
#define HPDMA_TRIGGER_HPDMA3_CH13_TCF (73U) /*!< HPDMA HW Trigger signal is HPDMA3_CH13_TCF */
#define HPDMA_TRIGGER_HPDMA3_CH14_TCF (74U) /*!< HPDMA HW Trigger signal is HPDMA3_CH14_TCF */
#define HPDMA_TRIGGER_HPDMA3_CH15_TCF (75U) /*!< HPDMA HW Trigger signal is HPDMA3_CH15_TCF */
#define HPDMA_TRIGGER_TIM2_TRGO       (76U) /*!< HPDMA HW Trigger signal is TIM2_TRGO       */
#define HPDMA_TRIGGER_TIM15_TRGO      (77U) /*!< HPDMA HW Trigger signal is TIM15_TRGO      */
#define HPDMA_TRIGGER_DCMIPP_P2_HSYNC (78U) /*!< HPDMA HW Trigger signal is DCMIPP_P2_HSYNC */
#define HPDMA_TRIGGER_DCMIPP_P2_VSYNC (79U) /*!< HPDMA HW Trigger signal is DCMIPP_P2_VSYNC */
#define HPDMA_TRIGGER_DCMIPP_P2_LEND  (80U) /*!< HPDMA HW Trigger signal is DCMIPP_P2_LEND  */
#define HPDMA_TRIGGER_DCMIPP_P2_FEND  (81U) /*!< HPDMA HW Trigger signal is DCMIPP_P2_FEND  */

/* LPDMA triggers */
#define LPDMA_TRIGGER_EXTI_LINE0      (0U)  /*!< LPDMA HW Trigger signal is EXTI_LINE0      */
#define LPDMA_TRIGGER_EXTI_LINE1      (1U)  /*!< LPDMA HW Trigger signal is EXTI_LINE1      */
#define LPDMA_TRIGGER_EXTI_LINE2      (2U)  /*!< LPDMA HW Trigger signal is EXTI_LINE2      */
#define LPDMA_TRIGGER_EXTI_LINE3      (3U)  /*!< LPDMA HW Trigger signal is EXTI_LINE3      */
#define LPDMA_TRIGGER_EXTI_LINE4      (4U)  /*!< LPDMA HW Trigger signal is EXTI_LINE4      */
#define LPDMA_TRIGGER_TAMP_TRG1       (5U)  /*!< LPDMA HW Trigger signal is TAMP_TRG1       */
#define LPDMA_TRIGGER_TAMP_TRG2       (6U)  /*!< LPDMA HW Trigger signal is TAMP_TRG2       */
#define LPDMA_TRIGGER_TAMP_TRG3       (7U)  /*!< LPDMA HW Trigger signal is TAMP_TRG3       */
#define LPDMA_TRIGGER_LPTIM2_CH1      (8U)  /*!< LPDMA HW Trigger signal is LPTIM2_CH1      */
#define LPDMA_TRIGGER_LPTIM3_CH1      (9U)  /*!< LPDMA HW Trigger signal is LPTIM3_CH1      */
#define LPDMA_TRIGGER_LPTIM4_CH1      (10U) /*!< LPDMA HW Trigger signal is LPTIM4_CH1      */
#define LPDMA_TRIGGER_LPTIM5_CH1      (11U) /*!< LPDMA HW Trigger signal is LPTIM5_CH1      */
#define LPDMA_TRIGGER_RTC_ALRA_TRG    (12U) /*!< LPDMA HW Trigger signal is RTC_ALRA_TRG    */
#define LPDMA_TRIGGER_RTC_ALRB_TRG    (13U) /*!< LPDMA HW Trigger signal is RTC_ALRB_TRG    */
#define LPDMA_TRIGGER_RTC_WUT_TRG     (14U) /*!< LPDMA HW Trigger signal is RTC_WUT_TRG     */
#define LPDMA_TRIGGER_LPDMA_CH0_TCF   (15U) /*!< LPDMA HW Trigger signal is LPDMA_CH0_TCF   */
#define LPDMA_TRIGGER_LPDMA_CH1_TCF   (16U) /*!< LPDMA HW Trigger signal is LPDMA_CH1_TCF   */
#define LPDMA_TRIGGER_LPDMA_CH2_TCF   (17U) /*!< LPDMA HW Trigger signal is LPDMA_CH2_TCF   */
#define LPDMA_TRIGGER_LPDMA_CH3_TCF   (18U) /*!< LPDMA HW Trigger signal is LPDMA_CH3_TCF   */
#define LPDMA_TRIGGER_HPDMA1_CH0_TCF  (19U) /*!< LPDMA HW Trigger signal is HPDMA1_CH0_TCF  */
#define LPDMA_TRIGGER_HPDMA1_CH8_TCF  (20U) /*!< LPDMA HW Trigger signal is HPDMA1_CH8_TCF  */
#define LPDMA_TRIGGER_HPDMA1_CH12_TCF (21U) /*!< LPDMA HW Trigger signal is HPDMA1_CH12_TCF */
#define LPDMA_TRIGGER_HPDMA2_CH0_TCF  (22U) /*!< LPDMA HW Trigger signal is HPDMA2_CH0_TCF  */
#define LPDMA_TRIGGER_HPDMA2_CH8_TCF  (23U) /*!< LPDMA HW Trigger signal is HPDMA2_CH8_TCF  */
#define LPDMA_TRIGGER_HPDMA2_CH12_TCF (24U) /*!< LPDMA HW Trigger signal is HPDMA2_CH12_TCF */
#define LPDMA_TRIGGER_HPDMA3_CH0_TCF  (25U) /*!< LPDMA HW Trigger signal is HPDMA3_CH0_TCF  */
#define LPDMA_TRIGGER_HPDMA3_CH8_TCF  (26U) /*!< LPDMA HW Trigger signal is HPDMA3_CH8_TCF  */
#define LPDMA_TRIGGER_HPDMA3_CH12_TCF (27U) /*!< LPDMA HW Trigger signal is HPDMA3_CH12_TCF */
#define LPDMA_TRIGGER_TIM2_TRGO       (28U) /*!< LPDMA HW Trigger signal is TIM2_TRGO       */
#define LPDMA_TRIGGER_TIM15_TRGO      (29U) /*!< LPDMA HW Trigger signal is TIM15_TRGO      */

#else

